backend/tests/load/matchmaking.yml
config:
  target: "http://localhost:3000"
  engines:
    socketio: {}
  phases:
    - duration: 60
      arrivalRate: 10
      name: "Warm up phase"
    - duration: 120
      arrivalRate: 50
      name: "Ramp up load"
    - duration: 300
      arrivalRate: 100
      name: "Cruising phase"
  processor: "./helpers.js"

scenarios:
  - name: "Authenticate and join matchmaking"
    engine: "socketio"
    flow:
      - function: "generateToken"
      - connect:
          auth:
             token: "{{ token }}"
      - emit:
          channel: "heartbeat"
      - think: 1
      - emit:
          channel: "joinQueue"
      - think: 5
      - emit:
          channel: "leaveQueue"
      - emit:
          channel: "disconnect"